# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mas'
brew 'gnupg'
brew 'php'
brew 'composer'
brew 'go'
brew 'node'

# Development
brew 'imagemagick'

# Dev
cask 'dbngin'
cask 'chrome'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'transmit'
cask 'phpstorm'
cask 'yaak'
cask 'font-ubuntu-mono'

# Utils
cask '1password'
cask '1password-cli'
cask 'caffeine'
cask 'httpie'
cask 'imageoptim'
cask 'nordvpn'

# Media
cask 'spotify'
cask 'plexamp'
cask 'vlc'

# Communication
cask 'discord'
cask 'messenger'
cask 'microsoft-teams'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696